//สร้างฟังก์ชัน ตรวจสอบว่า ตัวเลขที่ส่งค่าพารามิเตอร์ไป เป็นจำนวนเฉพาะหรือเปล่า
const checkPrime = (num) => {
  if (num === 0 || num === 1) return false; // เช็คว่า ตัวเลขที่ส่งค่าพารามิเตอร์ไปมีค่าเท่ากับ 0 หรือ 1 รึป่าว เพราะว่า 1 และ 0 ไม่ถือเป็นจำนวนเฉพาะ

  for (let divider = 2; divider < num; divider++) {
    //ตัวเลขที่ส่งค่าพารามิเตอร์ไปจะถูกนำไปวนลูปหารด้วยตัวเลขที่มีค่าน้อยกว่าพารามิเตอร์โดย ค่าพวกนั้นจะอยู่ไม่เกิน Range ของ พารามิเตอร์
    if (num % divider === 0) return false; // เช็คว่า ถ้าพารามิเตอร์หารด้วยค่าภายใน Range ของ ค่าพารามิเตอร์ลงตัว จะให้เป็น false
  }
  return true; // ถ้าตัวพารามิเตอร์ที่ส่งมา ไม่ตรงตาม 2 เงื่อนไขด้านบน หรือกล่าวคือ เป็นจำนวนเฉพาะให้ return ค่าเป็น true
};

//สร้าง function ที่สร้างผลลัพธ์เป็น Array range ของจำนวนเฉพาะโดย จะไม่เกินค่าพารามิเตอร์
const genPrimeNumber = (x) => {
  let result = []; //ตั้ง Array result ให้เป็น array เปล่า
  for (let num = 0; num < x; num++) {
    //ทำการลูปโดยให้เริ่มจาก 0 ไปจนถึงค่าสูงสุดที่ไม่เกิน ค่าพารามิเตอร์
    if (checkPrime(num)) {
      //condition ส่งตัวเลขที่เป็นตัว loop ไปเข้า function ข้างต้นเพื่อเช็คว่า num เป็นจำนวนเฉพาะหรือเปล่า
      result.push(num); // ถ้าใช่ให้เพิ่ม num ลงใน array result
    }
  }
  return result; //return ค่าจำนวนเฉพาะ
};

console.log(genPrimeNumber(20));
